# name = "Giga" მე იმიტომ შევქმენი name ცვლადი რომ მასში შევინახო მნიშნველობა და მომხმარებელმა იცოდეს ჩემი სახელი 
# surname = "Xucishvili" იმიტომ შევქმენი surname ცვლადი რომ მომხარებელს გაეგო ჩემი გვარი რომ უკეთ გაეცნოს და შევინახო მასში მნიშვნელობა
# age = 16 ეს იმიტომ შევქმენი რომ გაიგოს მომხმარებელმა ჩემი ასაკი და გამიცნოს უკეთ
# print(name + surname + age) აქ დავბეჭდე მე ჩემი სახელის მნიშვნელობა გვარის და ასევე ასაკის და ეს კოდი იქნება ერორი რადგან სტრინგი ინტეჯერთან არ დაემატება


# num1 = 10 
# num2 = 20
# print(str(num1) + str(num2)) აქ კოდი გამოვა 1020 რადგან რიცხვში წერია 10 და შემდეგ 20
 

# num1 = float(input("Enter number: "))
# print(type(num1)) აქ გამოიტანს <class 'float''> რადგან რიცხვი უდრის float ს


# x = ((True and False) or (False or False))
# y = ((False or True) and (False and True))
# print((x and y) or True) აქ გამოვა True რადგან ბოლოში უწერია or ოპერატორი როცა or ოპერატორი არის ბოლოში ერთი მაინც აუცილებლად გამოვა True


# age = int(input("Enter your age: "))
# print(age > 18) რადგანაც მომხმარებელი შემოიტანს 20 ს პასუხი იქნება True რადგან 20 არის 18 ზე მეტი ხოლო თუ შემოიტანს 18 ზე დაბალ რიცხვს იქნება პასუხი


