print("გავიცანი და დავუმეგობრდი:")
print("დათი ჩხიკვაძე")
print("მათე რეხვიაშვილი")
print("დემეტრე ექსეულიძე")
print("ბარბარე თინიკაშვილი")
print("ნიკოლოზ კუჭავა")
print("თაზო აბესაძე")



print("რას ვფიქრობ გოაზე")
print("პირველი იმას ვიტყვი რომ გოა არის საუკეთესო აკადემია")
print("არის საუკეთესო სწავლის საშუალება და მაღალ ანაზღაურებადი სამუშაო")
print("აქ ვსწავლობთ ყველაფერს ჩვენი მენტორის დახმარებით")
print("ბევრი ადამიანი გავიცანი და დავუმეგობრდი მეგობრული და საუკეთესო აკადემია")
print("მინდა ისიც დავამატო თურამე ვერ გაიგე ერთი სული აქვთ დაგეხმარონ")
print("მე მიხარია ამ გუნდის წევრობა ძალიან ძალიან მიყვარს გოა")
print("და მიყვარს საუკეთესო მენტორები ბატონი ნიკა კეშელავა ბატონი ლუკა ცხვარაძე")
