# 1) ჩანაწერი ნახოთ ხელახლა, ამოიწეროთ კაჰუტის შეკითხვები და დეტალურად ახსნათ და განმარტოთ პასუხები, დაწეროთ კოდი და გატესტოთ ყველ;აფერი

#რა არის პითონი პროგრამირებაში?
#a გველი #b დათვი #g პროგრამული ენა #d პროგრამული მოდული
#სწორი პასუხი არის პროგრამული ენა რადგან პითონში იწერება კოდები და არის პროგრამული ენა

#რა არის Turtle-ი Python -ში
#a ბიბლიოთეკა #b კუ #g მონაცემთა ტიპი #d ცვლადი
# Turtle არის ბიბლიოთეკა მასში შეგვიძლია ავაგოთ ნებისმიერი დიზაინის რამ სახლი კორპუსი სასახლე მეფე და ასე შემდეგ იგი კარგიც და სახალისოცაა

# print('heloo World')
#ეს გამოიტანს 'heloo World'-ს რადგან როგორც კოდში წერია ისე გამოიტანს ტერმინალში

#რას გამოიტანს ეს კოდი ტერმინალში?
# print(True > False)
#აქ პასუხი არის True რადგან True მეტია False ზე True არის 1 და False არის 0 ამიტომ 1 მეტია 0 ზე

#რითი ვქმნით კომენტარებს python -ში?

#კომენტარებს პითონში ვქმნით # ამის გამოყენებით რადგან სხვა შემთხვევაში მაგალითად რომ დავწეროთ ეს // ან ნებისმიერი სხვა იქნება Error-ი

#რას გამოიტანს ეს კოდი ტერმინალში?
#x = 15
#y = 4
#print(x // y)

#აქ პასუხი იქნება 3 რადგან 15 რომ % 4 ნაშთი გვრჩება 3 რადგან 4 შედის 15 ში სამჯერ

#რას გამოიტანს ეს კოდი ტერმინალში?
#x = 10
#y = 4
#print(x / y)

#პასუხი არის ორი რადგან 4 მოთავსდება 10 ში ორჯერ

#რას გამოიტანს ეს კოდი ტერმინალში?
#x = 10
#y = "20"
# print(x + y)

#აქ იქნება Error რადგან y ში რიცხვს უწერია სტრინგი და x ში არ წერია და კიდევ იმიტომ იქნება Error რომ რიცხვში არ იწერება სტრინგი

#რას გამოიტანს ეს კოდი ტერმინალში?
#x = 5
#y = 2
#print(x ** y)

#აქ პასუხი არის 25 რადგან 5 ის კვადტარი 25 ია 

#if მუშაობს else-ის გარეშე

#ეს პასუხი არის სწორი რადგან

#if ებითაც გაკეთდება მხოლოდ:

# if temperature > 25:
    #print("it's hot outside")

#if temperature < 15:
    # print("it's cold outside")

#რითი მთავრდება for loop?

#for loop მთავრდება break ით რადგან break არის სტოპი გაჩერება


#რა იქნება თუ 10 % 3 ?

#10 რომ % 3 ზე იქნება 1 რადგან 3 ათში 3 ჯერ მოთავსდება და ნაშთი გვრჩება 1

#integer-ი მრავლდება string-ზე

#a True #b False

#აქ პასუხი არის True რადგან ეს მაგალითი გამოიტანს True ს იმიტომ რომ integer-ი თავისუფლად მრავლდება string-ზე

# 15 * '10'

#რას გამოიტანს ეს კოდი ტერმინალში?

#print(3>4 or 3<5 and 500 < 400 or 320 > 244)

#პასუხი არის True რადგან 320 > 244 ზე

#რა არის სია list?

#სია list ის მაგალითი:

# Creating an array of integers
# my_array = arr.array('i', [1, 2, 3, 4, 5])

# Accessing elements
# print(my_array[0])  # Output: 1

# Modifying elements
# my_array[1] = 9
# print(my_array)  # Output: array('i', [1, 9, 3, 4, 5])


#რა არის ალგორითმი?

#ალგორითმი არის მოქმედების ნაბიჯ ნაბიჯ ზედ მიწევნით შესრულება ალგორითმი შეგვიძლია დაგვჭირდეს და გამოვიყენოთ ცხოვრებაში



